app/controllers/registrations_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"